RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_edim_biss.h
/* EDIM_BISS interrupt enable or disable */
#define EDIM_BISS_INTEN_MASK                    ((uint32_t)0x000003BEU)
#define EDIM_BISS_INT_EODTIE                    EDIM_BISS_CNTINTEN_EODTIE                 /*!< EDIM_BISS end of data transmission interrupt enable */
#define EDIM_BISS_INT_CCERRIE                   EDIM_BISS_CNTINTEN_CCERRIE                /*!< EDIM_BISS control communication error interrupt enable */
#define EDIM_BISS_INT_PDTERRIE                  EDIM_BISS_CNTINTEN_PDTERRIE               /*!< EDIM_BISS process data transmission error interrupt enable */
#define EDIM_BISS_INT_SERRIE                    EDIM_BISS_CNTINTEN_SERRIE                 /*!< EDIM_BISS start bit error interrupt enable */
#define EDIM_BISS_INT_ADTERRIE                  EDIM_BISS_CNTINTEN_ADTERRIE               /*!< EDIM_BISS automatic data transmission error interrupt enable */
#define EDIM_BISS_INT_DMATOIE                   EDIM_BISS_CNTINTEN_DMATOIE                /*!< EDIM_BISS DMA request timeout error interrupt enable */
#define EDIM_BISS_INT_FIFOUNRIE                 EDIM_BISS_CNTINTEN_FIFOUNRIE              /*!< EDIM_BISS FIFO underrun interrupt enable */
#define EDIM_BISS_INT_FIFOOVRIE                 EDIM_BISS_CNTINTEN_FIFOOVRIE              /*!< EDIM_BISS FIFO overrun interrupt enable */

/* define the EDIM_BISS bit position and its register index offset */
#define EDIM_BISS_REGIDX_BIT(regidx, bitpos)   (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define EDIM_BISS_REG_VAL(edim_periph, offset)              (REG32((edim_periph) + ((uint32_t)((offset) & 0x0000FFFFU) >> 6)))
#define EDIM_BISS_BIT_POS(val)                 ((uint32_t)(val) & 0x0000001FU)
#define EDIM_BISS_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                                   | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define EDIM_BISS_REG_VAL2(edim_periph, offset)               (REG32((edim_periph) + ((uint32_t)(offset) >> 22)))
#define EDIM_BISS_BIT_POS2(val)                  (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define EDIM_BISS_CNTINTEN_REG_OFFSET               ((uint32_t)0x000000ECU)                     /*!< EDIM_BISS_CNTINTEN register offset */
#define EDIM_BISS_STAT0_REG_OFFSET                  ((uint32_t)0x000000F0U)                     /*!< EDIM_BISS status register 0 offset */
#define EDIM_BISS_STAT1_REG_OFFSET                  ((uint32_t)0x000000F8U)                     /*!< EDIM_BISS status register 1 offset */

/* EDIM_BISS interrupt flag */
typedef enum {
    EDIM_BISS_INT_FLAG_EODT        = EDIM_BISS_REGIDX_BIT2(EDIM_BISS_CNTINTEN_REG_OFFSET, 1U, EDIM_BISS_STAT1_REG_OFFSET, 28U),         /*!< EDIM_BISS end of data transmission interrupt flag */
    EDIM_BISS_INT_FLAG_CCERR       = EDIM_BISS_REGIDX_BIT2(EDIM_BISS_CNTINTEN_REG_OFFSET, 2U, EDIM_BISS_STAT0_REG_OFFSET, 3U),          /*!< EDIM_BISS control communication error interrupt flag */
    EDIM_BISS_INT_FLAG_PDTERR      = EDIM_BISS_REGIDX_BIT2(EDIM_BISS_CNTINTEN_REG_OFFSET, 3U, EDIM_BISS_STAT0_REG_OFFSET, 4U),          /*!< EDIM_BISS process data transmission error interrupt flag */
    EDIM_BISS_INT_FLAG_SERR        = EDIM_BISS_REGIDX_BIT2(EDIM_BISS_CNTINTEN_REG_OFFSET, 4U, EDIM_BISS_STAT0_REG_OFFSET, 5U),          /*!< EDIM_BISS start bit error interrupt flag */
    EDIM_BISS_INT_FLAG_ADTERR      = EDIM_BISS_REGIDX_BIT2(EDIM_BISS_CNTINTEN_REG_OFFSET, 5U, EDIM_BISS_STAT0_REG_OFFSET, 6U),          /*!< EDIM_BISS automatic data transmission error interrupt flag */
    EDIM_BISS_INT_FLAG_DMATO       = EDIM_BISS_REGIDX_BIT2(EDIM_BISS_CNTINTEN_REG_OFFSET, 7U, EDIM_BISS_STAT1_REG_OFFSET, 25U),         /*!< EDIM_BISS DMA request timeout error interrupt flag */
    EDIM_BISS_INT_FLAG_FIFOUNR     = EDIM_BISS_REGIDX_BIT2(EDIM_BISS_CNTINTEN_REG_OFFSET, 8U, EDIM_BISS_STAT1_REG_OFFSET, 26U),         /*!< EDIM_BISS FIFO underrun error interrupt flag */
    EDIM_BISS_INT_FLAG_FIFOOVR     = EDIM_BISS_REGIDX_BIT2(EDIM_BISS_CNTINTEN_REG_OFFSET, 9U, EDIM_BISS_STAT1_REG_OFFSET, 27U),         /*!< EDIM_BISS FIFO overrun error interrupt flag */
} edim_biss_interrupt_flag_enum;

/* EDIM_BISS flags */
typedef enum {
    EDIM_BISS_FLAG_EODT                = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 0U),          /*!< EDIM_BISS end of data transmission flag */
    EDIM_BISS_FLAG_EOFT                = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 1U),          /*!< EDIM_BISS end of frame transmission flag */
    EDIM_BISS_FLAG_EOCC                = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 2U),          /*!< EDIM_BISS end of control communication flag */
    EDIM_BISS_FLAG_CCERRN              = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 3U),          /*!< EDIM_BISS no control communication error interrupt flag */
    EDIM_BISS_FLAG_PDTERRN             = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 4U),          /*!< EDIM_BISS no process data transmission error interrupt flag */
    EDIM_BISS_FLAG_SERRN               = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 5U),          /*!< EDIM_BISS no start bit error interrupt flag in register communication */
    EDIM_BISS_FLAG_ADTERRN             = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 6U),          /*!< EDIM_BISS no automatic data transmission error interrupt flag */
    EDIM_BISS_FLAG_INERRN              = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 7U),          /*!< EDIM_BISS no internal error flag*/
    EDIM_BISS_FLAG_SLAVE0_DATA_VALID   = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 9U),          /*!< EDIM_BISS slave 0 data validity flag */
    EDIM_BISS_FLAG_SLAVE1_DATA_VALID   = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 11U),         /*!< EDIM_BISS slave 1 data validity flag */
    EDIM_BISS_FLAG_SLAVE2_DATA_VALID   = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 13U),         /*!< EDIM_BISS slave 2 data validity flag */
    EDIM_BISS_FLAG_SLAVE3_DATA_VALID   = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 15U),         /*!< EDIM_BISS slave 3 data validity flag */
    EDIM_BISS_FLAG_SLAVE4_DATA_VALID   = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 17U),         /*!< EDIM_BISS slave 4 data validity flag */
    EDIM_BISS_FLAG_SLAVE5_DATA_VALID   = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 19U),         /*!< EDIM_BISS slave 5 data validity flag */
    EDIM_BISS_FLAG_SLAVE6_DATA_VALID   = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 21U),         /*!< EDIM_BISS slave 6 data validity flag */
    EDIM_BISS_FLAG_SLAVE7_DATA_VALID   = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 23U),         /*!< EDIM_BISS slave 7 data validity flag */
    EDIM_BISS_FLAG_CDS                 = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 30U),         /*!< EDIM_BISS CDS bit sent by slave */
    EDIM_BISS_FLAG_CDMTOF              = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT0_REG_OFFSET, 31U),         /*!< EDIM_BISS CDM timeout completion flag in control communication */
    EDIM_BISS_FLAG_SLIN                = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT1_REG_OFFSET, 0U),          /*!< EDIM_BISS SL line input level state */
    EDIM_BISS_FLAG_CDSBU               = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT1_REG_OFFSET, 1U),          /*!< EDIM_BISS CDS bit backup */
    EDIM_BISS_FLAG_RBSWERR             = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT1_REG_OFFSET, 24U),         /*!< EDIM_BISS RAM bank switching error flag */
    EDIM_BISS_FLAG_DMATO               = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT1_REG_OFFSET, 25U),         /*!< EDIM_BISS DMA request timeout error interrupt flag */
    EDIM_BISS_FLAG_FIFOUNR             = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT1_REG_OFFSET, 26U),         /*!< EDIM_BISS FIFO underrun error interrupt flag */
    EDIM_BISS_FLAG_FIFOOVR             = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT1_REG_OFFSET, 27U),         /*!< EDIM_BISS FIFO overrun error interrupt flag */
    EDIM_BISS_FLAG_EODTIF              = EDIM_BISS_REGIDX_BIT(EDIM_BISS_STAT1_REG_OFFSET, 28U),         /*!< EDIM_BISS end of data transmission interrupt flag */
}edim_biss_flag_enum;


/* constants definitions */
/* EDIM_BiSS slave parameter struct definitions */
typedef struct
{   
    uint32_t data_length;                                                       /*!< length of process data in bits */
    uint32_t crc_poly;                                                          /*!< crc polynomial used for error checking */
    uint32_t crc_init_value;                                                    /*!< initial value for crc calculation */
} edim_biss_slave_parameter_struct;

/* EDIM_BiSS parameter struct definitions */
typedef struct
{   
    uint32_t ma_prescaler;                                                      /*!< master clock prescaler for automatic data transmission */
    uint32_t ma_force_control_level;                                            /*!< force control level for MA signal */
    uint32_t n_slave;                                                           /*!< number of slaves connected */
    edim_biss_slave_parameter_struct slave_config[8];                           /*!< array to slave configuration structure */
} edim_biss_init_parameter_struct;

